export type Pages = ((string | undefined)[] | undefined)[];

export const sample: Pages = [
    [
        "昔々、あるところに大きなかぶがありました。\n誰も抜けない大きなかぶです。",
        "そこへお爺さんとお婆さんがやってきました。\nお爺さんとお婆さんは言いました。",
        "「わたしたちには子どもがいない。この大きなかぶを子どもということにしてしまおう」",
        "こうして、二人は大きなかぶを子どもにして、大きなかぶ太郎と名付けました。",
        "三人は末長く幸せに暮らしましたとさ。",
        "めでたし　めでたし",
    ],
    [
        "大きなかぶはある日考えました。",
        "「こんなかぶをいったい誰が抜くのだろう？　そんな人がいるなら、顔を見てみたいものだ！」",
        "",
    ],
    [
        "「俺はこの畑しか知らない。もっと広い世界を見てみたい」",
        "「だったら、俺が抜いてやる」と突然、森から屈強な鬼が現れました。"
    ],
    [
        "こうしてかぶは世界を見るための旅に出ました。\n「よっこいしょっと！」\n大きなかぶは抜けないので、周りの地面ごと立ち上がります。"
    ],
    [
        "立ち上がった大きなかぶはどこまでもどこまでも歩いていきましたが、どこまで行っても同じ景色です。"
    ],
    [
        "「この世界というのは思ったよりつまらないものだな」\n大きなかぶはがっかりしてしまいましたとさ。\nおしまい！"
    ],
];
