export type Pages = ((string | undefined)[] | undefined)[];

export const sample: Pages = [
    [
        "昔々、あるところに大きなカブがありました。\n誰も抜けない大きなカブです。",
        "そこへお爺さんとお婆さんがやってきました。\nお爺さんとお婆さんは言いました。",
        "「わたしたちには子どもがいない。この大きなカブを子どもということにしてしまおう」",
        "こうして、二人は大きなカブを子どもにして、大きなカブ太郎と名付けました。",
        "三人は末長く幸せに暮らしましたとさ。",
        "めでたし　めでたし",
    ],
    [
        "大きなカブはある日考えました。",
        "「こんなカブをいったい誰が抜くのだろう？　そんな人がいるなら、顔を見てみたいものだ！」",
        "「そして、大きなカブ太郎という名前を与えよう！」",
        "大きなカブはとても誇らしい気分になり、末長く幸せでした。",
        "めでたし　めでたし",
    ],
    [
        "「俺はこの畑しか知らない。もっと広い世界を見てみたい」",
        "「だったら、俺が抜いてやる」と突然、森から屈強な鬼が現れました。",
        "「うおお！」と大きなカブは突然立ち上がります。",
        "大きなカブは「俺が大きなカブ太郎だ！」と大きな声で叫びました。\nその声は遥か海の向こうでも聞こえたと言います。",
    ],
    [
        "こうしてカブは世界を見るための旅に出ました。\n「よっこいしょっと！」\n大きなカブは抜けないので、周りの地面ごと立ち上がります。",
        "",
        "",
    ],
    [
        "立ち上がった大きなカブはどこまでもどこまでも歩いていきましたが、どこまで行っても同じ景色です。",
        "",
    ],
    [
        "「この世界というのは思ったよりつまらないものだな」\n大きなカブはがっかりしてしまいましたとさ。\nおしまい！",
    ],
];
